import { View, Text } from 'native-base';
import Header from "../../../components/Header";
import React from 'react';
import { StyleSheet, ScrollView } from 'react-native';

const style = StyleSheet.create({
    wrapper: {
        paddingHorizontal: 10
    },
    title: {
        fontSize: 24,
        fontWeight: 'bold'
    },
    content: {
        marginTop: 15
    },
    subTitle: {
        fontWeight: 'bold',
    }
})

const ContractInformationForm = ({navigation}) => (
    <View>
        <Header navigation={navigation} />
        <ScrollView style={style.wrapper}>
            <Text style={style.title}>Угода користування</Text>
            <Text style={style.content}>
                    Ця угода користувача (далі — «Угода» або «Угода користувача») регламентує відносини між Громадською організацією «Івано-Франківський ІТ-кластер» (Ідентифікаційний код: 39879896), (далі — «організація»), та особами, які в порядку та на умовах передбачених цією угодою, приєдналися до неї (далі - «користувач») для отримання права використання мобільного застосунку “IT BENEFITS” (далі - «мобільний додаток»), організація та користувачі іменуються надалі – «сторони».{'\n'}
                Умови цієї угоди є публічною офертою відповідно до статті 633 Цивільного кодексу України. Використання мобільного додатку можливе виключно на умовах цієї угоди. Ця угода є публічним договором приєднання, тобто згідно зі статтями 633, 634 Цивільного кодексу України її умови є однаковими для всіх користувачів.{'\n'}
                Згідно із статтями 638, 642 Цивільного кодексу України, у разі прийняття умов цієї угоди (акцепт) користувач повинен вказати в мобільному додатку всі необхідні дані, які вимагаються організацією та проставити відповідну відмітку про це. У цьому випадку ця угода вважатиметься укладеною.{'\n'}
                Увага! Якщо Вам не виповнилося 16 років відповідно до чинного законодавства, то Ви не відповідаєте вимогам користувача згідно із цією угодою, а тому не використовуйте мобільний додаток. Проте, Ви можете зв’язатися з Організацією, надіславши листа на електронну адресу та надіслати згоду одного з законних представників (батьки, усиновлювачі, опікуни або інших осіб визначених законом). {'\n'}
                <Text style={style.subTitle}>{'\n'}1. ЗАГАЛЬНІ ПОЛОЖЕННЯ{'\n'}{'\n'}</Text>
                Мобільний додаток - застосунок (програмне забезпечення) розроблене для засобів обчислювальної техніки (смартфонів), які працюють на базі операційних систем «iOS» та «Android», в тому числі планшетних пристроїв (далі – мобільні пристрої), набір інструкцій з індивідуальною структурою та дизайном у вигляді слів, цифр, кодів, схем, символів чи у будь-якому іншому вигляді, виражених у формі, придатній для зчитування на мобільному пристрої, які приводять його у дію, що містить пропозиції суб’єктів господарювання на купівлю товару/послуги на вигідних для користувача умовах. {'\n'}
                Мобільний додаток надає можливість отримати доступ до бази даних запропонованих пропозицій суб’єктів господарювання на купівлю товарів/послуг на вигідних умовах, яка міститься в додатку.  {'\n'}
                Завантаження мобільного додатку на мобільний пристрій користувача здійснюються через мобільний застосунок PlayMarket (для операційних систем «Android») або через мобільний застосунок AppStore (для операційних систем «iOS»).{'\n'}
                Користувачами мобільного додатку є будь-які фізичні особи, які досягли 16 років, отримали можливість користуватися мобільним додатком. {'\n'}
                    Будь-яка інформація, яка надається користувачу під час користування мобільним додатком має рекомендований зміст, не є обов’язковою до виконання користувачем і не несе ніякої відповідальності для організації.{'\n'}
                Отримання користувачем доступу до мобільного додатку відбувається шляхом реєстрації у ньому. Під час реєстрації користувач зазначає своє ім’я, прізвище, електронну адресу та створює власний набір літер, цифр, символів для подальшого підтвердження його особи (пароль) та проставляє відповідну відмітку у полі “Ознайомлений(а) з угодою користування”. За бажанням, користувач може вказати додаткові відомості: місце роботи, посада.{'\n'}
                Після реєстрації, отримання в мобільному додатку пропозиції від суб’єктів господарювання на купівлю товару/послуги на вигідних умовах є оплатним і здійснюється після активації підписки. Підписка на отримання в мобільному додатку пропозиції на купівлю товару/послуги на вигідних умовах активується на один місяць після її оплати.{'\n'}
                Оплата здійснюється користувачем самостійно через платіжний сервіс Банку -  LiqPay (далі - платіжний сервіс) або будь-якою третьою особою з якою організація уклала відповідний письмовий договір в порядку та на умовах визначених таким договором. {'\n'}
                {'\n'}
                Без здійснення оплати через платіжний сервіс, або в порядку та на умовах визначених договором між організацією та третьою особою, користувач не отримує в мобільному додатку доступ до використання пропозиції на купівлю товару/послуги на вигідних умовах. У цьому випадку користувачу надається можливість тільки переглянути перелік таких пропозицій. {'\n'}
                У разі активації підписки через платіжну систему, користувач надає згоду на автоматичне регулярне продовження підписки на новий термін (автопродовження підписки). Після активації підписки оплата на новий термін здійснюється шляхом автоматичного безакцептного списання коштів з рахунку користувача. Послуга автопродовження підписки надається до тих пір, поки користувач не скасує її самостійно.{'\n'}
                При зміні вартості підписки у мобільному додатку, автопродовження підписки на новий термін, наступний за періодом, протягом якого відбулася така зміна, оплата  здійснюється згідно нової вартості. Перед зміною вартості підписки організація повідомляє про це користувача та третіх осіб завчасно, шляхом надсилання електронного повідомлення на електронні адреси, які були вказані користувачем під час реєстрації або в порядку визначеному договором, укладеного між організацією та третьою особою. {'\n'}
                Всі персональні дані збираються та обробляються організацією згідно із Законом України “Про захист персональних даних”. Реєструючись у мобільному додатку, користувач надає згоду на передачу та обробку своїх персональних даних. Користувач підтверджує свою згоду на передачу вказаних вище персональних даних третім особам і їх обробку третіми особами в цілях виконання цієї угоди і отримання  пропозиції на купівлю товару/послуги на вигідних умовах, а також вирішення претензій, пов'язаних з виконанням цієї угоди.{'\n'}
                Ця угода, може бути змінена і/або доповнена організацією в односторонньому порядку. При цьому продовження використання мобільного додатка після внесення змін і/або таких доповнень, означає згоду користувача з такими змінами і/або доповненнями. У разі незгоди користувача з умовами цієї угоди, які будуть викладені в новій редакції (змінені, доповнені), користувач зобов’язаний припинити використання мобільного додатку.{'\n'}
                Будь-які звернення, скарги, пропозиції користувача до організації, пов'язані зі змістом і функціонуванням мобільного додатку, порушенням прав та інтересів третіх осіб, вимог законодавства України розглядаються організацією за умови, що такі звернення, скарги, пропозиції надіслані на електронну адресу організації: itbenefitscard@gmail.com{'\n'}
                Ця угода складена відповідно до законодавства України. Умови, які не врегульовані цією угодою, вирішуються відповідно до законодавства України.{'\n'}
                Погоджуючись з умовами цієї угоди, користувач підтверджує достовірність наданих ним при реєстрації даних та приймає на себе усі ризики, які виникнуть або можуть виникнути стосовно точності, повноти і достовірності таких даних. {'\n'}
                Ця угода є відкритою  та загальнодоступною. Будь-яка фізична особа, яка має намір отримати можливість користуватися мобільним додатком зобов’язана ознайомитися з нею.{'\n'}
                <Text style={style.subTitle}>{'\n'}2. ПРАВА ТА ОБОВ’ЯЗКИ КОРИСТУВАЧА{'\n'}{'\n'}</Text>
                Користувач зобов’язаний належним чином дотримуватися умов цієї угоди.{'\n'}
                Користувач має право користуватися мобільним додатком виключно з метою отримання пропозицій від суб’єктів господарювання на купівлю товару/послуги на вигідних для користувача умовах.  {'\n'}
                Користувач зобов'язується не використовувати мобільний додаток з порушенням прав і законних інтересів будь-яких третіх осіб і цієї угоди.{'\n'}
                Користувач зобов'язується вживати належні заходи для збереження свого мобільного пристрою і несе особисту відповідальність у разі доступу до його мобільного пристрою третіх осіб.{'\n'}
                Користувач не має права здійснювати будь-які дії з\в додатком (-у), які не пов’язані з метою користування, встановленою цією угодою, зокрема, але не виключно самостійно або із залученням третіх осіб здійснювати декомпіляцію, реверс-інжиніринг мобільного додатка, будь-яким чином та будь-яким способом втручатися в мобільний додаток чи його частину.{'\n'}
                Користувачу заборонено надсилати шляхом використання мобільного додатку матеріалів рекламного, еротичного, порнографічного, образливого характеру або таких матеріалів, які не мають відношення до мети функціонування мобільного додатку.{'\n'}
                У випадку, якщо при використанні мобільного додатку користувачу будь-яким способом стала відома інформація організації та/або третіх осіб, яка відповідно до законодавства України, внутрішніх положень відноситься до конфіденційної та/або до комерційної таємниці, користувачу заборонено зберігати, використовувати і будь-яким способом поширювати таку інформацію.{'\n'}
                <Text style={style.subTitle}> {'\n'}3. ПРАВА ТА ОБОВ’ЯЗКИ ОРГАНІЗАЦІЇ{'\n'}{'\n'}</Text>
                Організація має право передавати свої права і обов'язки за цією угодою третім особам без будь-якої згоди користувача.{'\n'}
                Організація має право надіслати користувачу тестові, мультимедійні повідомлення, що містять інформацію про мобільний додаток, інформацію рекламного змісту з використанням будь-яких телекомунікаційних мереж, на електронну пошту та розміщувати відповідну інформацію у мобільному додатку.{'\n'}
                Організація має право без попереднього повідомлення обмежити, призупинити або припинити користування мобільним додатком без відшкодування користувачу збитків, у разі, якщо в організації є підстави вважати, що користувач або пов’язані з ним особи  (умисно чи з необережності):{'\n'}
                    • під час користування мобільним додатком порушують законодавство, положення цієї угоди або права та законні інтереси третіх осіб;{'\n'}
                    • користуються мобільним додатком недобросовісно, або не у відповідності з його метою, призначенням;{'\n'}
                    • наносять шкоду мобільному додатку, в тому числі його функціональним можливостям;{'\n'}
                    • здійснюють спроби несанкціонованого доступу до мобільного додатку та інформації у ньому;{'\n'}
                    • створюють загрозу збою технічних та/або програмних засобів організації та/або третіх осіб.{'\n'}
                Організація має право без попереднього повідомлення обмежити, призупинити або припинити користування мобільним додатком у разі прийняття будь-якого рішення органу державної влади яке впливає на можливість використання додатка.{'\n'}
                <Text style={style.subTitle}>{'\n'}4. ГАРАНТІЇ ТА ВІДПОВІДАЛЬНІСТЬ{'\n'}{'\n'}</Text>
                Користувач гарантує, що не вчинятиме будь-які дії, спрямовані виключно на спричинення збитків організації  або третім особам.{'\n'}
                У разі порушення правил використання мобільного додатка, обов'язків користувача, не дотримання інших умов цієї угоди, користувач зобов'язується відшкодувати організації збитки, заподіяні такими діями в повному обсязі.{'\n'}
                Користувач несе повну відповідальність за протиправний доступ третіх осіб до мобільного додатка, встановленого на мобільний пристрій користувача.{'\n'}
                Користувач несе повну відповідальність у разі втрати, видалення, поширення внесеної ним у мобільний додаток інформації в результаті його дій/бездіяльності.{'\n'}
                Організація не гарантує користувачу відповідність мобільного додатку очікуванням користувача, його безперебійну й безпомилкову роботу.{'\n'}
                Організація не несе відповідальності у разі використання або невикористання, у т.ч. неможливості використання мобільного додатку.{'\n'}
                Організація не несе відповідальності за шкоду або збитки, яких зазнав користувач або треті особи в результаті помилкового тлумачення або нерозуміння умов цієї угоди,а також у разі фактичного не надання або надання не в повному обсязі суб’єктами господарювання користувачу пропозицій на купівлю товару/послуги  на вигідних умовах, які були вказані в мобільному додатку.{'\n'}
                Організація не несе відповідальності за використання третіми особами інформації, отриманої від користувача, включаючи її копіювання, відтворення й поширення, здійснені як у рамках мобільного додатку, так і іншими можливими способами.{'\n'}
                <Text style={style.subTitle}>{'\n'}5. ПРАВА ІНТЕЛЕКТУАЛЬНОЇ ВЛАСНОСТІ{'\n'}{'\n'}</Text>
                Користувач гарантує, що ним не порушуються будь-які права третіх осіб, в тому числі права інтелектуальної власності та логотипи, зображення, опис, що надаються користувачем при використанні мобільного  додатку.{'\n'}
                Користувачеві заборонено будь-яке використання в комерційних цілях будь-якої інформації та об'єктів інтелектуальної власності, що розміщені у мобільному додатку, без письмового дозволу на це організації або відповідного правовласника.{'\n'}
                Мобільний додаток є власністю організації.{'\n'}{'\n'}
                <Text style={style.subTitle}>6. ЗАКЛЮЧНІ ПОЛОЖЕННЯ{'\n'}{'\n'}</Text>
                Усі спори, що пов’язані або можуть виникнути з цієї угоди вирішуються між користувачем та організацією шляхом переговорів. Якщо спір не може бути вирішений шляхом переговорів, він вирішується в судовому порядку за встановленою предметною та територіальною юрисдикцією такого спору, визначеному відповідним чинним законодавством України.{'\n'}
                Користувач та організація не несуть відповідальність за невиконання або неналежне виконання зобов'язань за цією угодою, якщо повне або часткове не виконання виявилося неможливим внаслідок непереборної сили (форс-мажорних обставин).{'\n'}
                Ця угода вступає в силу для Користувача з моменту реєстрації в мобільному додатку в порядку, визначеному цією угодою і діє безстроково.{'\n'}
                Користувач та організація маю право в односторонньому порядку розірвати цю угоду. В цьому випадку користувач зобов’язаний припинити користування мобільним додатком.{'\n'}
                Ця Угода складена українською мовою.{'\n'}
                Визнання недійсним, таким, що не відповідає вимогам закону окремого пункту (окремих пунктів) цієї угоди не тягне за собою визнання недійсним цієї угоди в цілому.{'\n'}{'\n'}
                РЕКВІЗИТИ{'\n'}
                ГРОМАДСЬКА ОРГАНІЗАЦІЯ{'\n'}
                "ІВАНО-ФРАНКІВСЬКИЙ ІТ КЛАСТЕР"{'\n'}{'\n'}

                Ідентифікаційний код: 39879896{'\n'}
                Місцезнаходження: 76005 Україна,  м. Івано-Франківськ,  вул. Чорновола, буд. 125А, кв. 9{'\n'}
                E-mail: itbenefitscard@gmail.com{'\n'}
                {'\n'}
            </Text>
        </ScrollView>
    </View>
);

export default ContractInformationForm;